# Homebrew basics
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "mas"
brew "cask"

# Basic installation
brew "fish"

# Deployment apps
brew "mage"
brew "opentofu"
brew "pipx"
brew "podman"
brew "podman-compose"
brew "terraform"
brew "vault"

# Deployment nice to have things
brew "direnv"

# Others
cask "powershell"
cask "vscode"
cask "gimp"
cask "spotify"
cask "warp"
cask "zed"

# VSCode Add-Ins
vscode "hashicorp.terraform"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.powershell"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"

# VSCode Themes
vscode "catppuccin.catppuccin-vsc"